ext_ОбщиеДоработки/ka2_2024.ОбщиеДоработкиРВК/src/Documents/РеализацияТоваровУслуг/РеализацияТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="8eac9a31-ed8b-4965-85f9-086b89e1764b">
  <name>РеализацияТоваровУслуг</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="015a5e71-6dc7-4bc2-a50c-fa1ea71ab233">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="888045d6-ba8c-43b1-b536-7c557764fc60">
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b94b39c7-d1eb-4128-89ea-6fe5410160da">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="50c9ead0-2833-4f57-86bb-47fa6ffdc8aa">
    <name>Партнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="73c9f7da-a335-4b2e-976f-57e95ab06e13">
    <name>ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e5b27a28-42e1-42b3-806c-83e1fbeb7907">
    <name>Договор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="8139626e-8ad5-43ef-8108-a207607b40b5">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
  <tabularSections extendedConfigurationObject="a37e84ac-bf38-4699-99ca-e57572841cfc">
    <name>ВидыЗапасов</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="e4986aa8-bcf8-443e-9b49-4140b2505fa4">
      <name>АналитикаУчетаНоменклатуры</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

ext_ОбщиеДоработки/ka2_2024.ОбщиеДоработкиРВК/src/Documents/ПриобретениеТоваровУслуг/ПриобретениеТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="5e0d9dd9-464c-4fa3-984a-2a2da8517f38">
  <name>ПриобретениеТоваровУслуг</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="7af43f23-66b5-4041-bd23-3216b1d23915">
    <name>НомерВходящегоДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="49c74d36-ce0a-47f3-b6eb-899238c5cc0f">
    <name>ДатаВходящегоДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="c3c6b97e-7d9a-4a6b-8cfd-5a1d2a1e2450">
    <name>НалогообложениеНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5eb8b5ad-0eec-40f5-88b2-f1412f212359">
    <name>ЗакупкаПодДеятельность</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="a595dc27-9b9c-47fc-a70f-c6763ab3d7a2">
    <name>Согласован</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="dd906d50-e8be-4b18-b32c-c20813240936">
    <name>ВариантПриемкиТоваров</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c545b75d-dd2d-4844-903e-a04b725622b7">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="941aa10e-3657-48ec-8f9d-92e38e90ecbf">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="87bdbf54-2a81-44f1-b7b9-18f0ca2a2511">
      <name>НомерГТД</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

ext_ОбщиеДоработки/ka2_2024.ОбщиеДоработкиРВК/src/Documents/РеализацияТоваровУслуг/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура рвк_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	рвк_ИнициализироватьЕстьРеквизитСУчетнойЦеной();
КонецПроцедуры

&НаКлиенте
Процедура рвк_ПриОткрытииПосле(Отказ)
	рвк_ОбновитьЗадолженностьНаКлиенте();
КонецПроцедуры

&НаСервере
Процедура рвк_ПередЗаписьюНаСервереПосле(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ПараметрыСеанса.ПроводитьБезКонтроляОстатковТоваровОрганизаций = Ложь Тогда
		ПараметрыСеанса.ПроводитьБезКонтроляОстатковТоваровОрганизаций = Истина;
		рвк_БылВыключенРежимКонтроляОстатков = Истина;	
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура рвк_ПослеЗаписиНаСервереПосле(ТекущийОбъект, ПараметрыЗаписи)
	Если рвк_БылВыключенРежимКонтроляОстатков Тогда 
		рвк_БылВыключенРежимКонтроляОстатков = Ложь;
		Если ПараметрыСеанса.ПроводитьБезКонтроляОстатковТоваровОрганизаций Тогда
			ПараметрыСеанса.ПроводитьБезКонтроляОстатковТоваровОрганизаций = Ложь;
		КонецЕсли;	
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура рвк_ПартнерПриИзмененииПосле(Элемент)
	рвк_ОбновитьЗадолженностьНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура рвк_ТекстДокументыНаОснованииОбработкаНавигационнойСсылкиВместо(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	Если НавигационнаяСсылкаФорматированнойСтроки = "ОткрытьПриобретениеТоваровИнтеркампани" Тогда
		СтандартнаяОбработка = Ложь;
		ПоказатьЗначение(, рвк_ПолучитьСсылкуПриобретения(Объект.Ссылка));
	Иначе
		ПродолжитьВызов(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура рвк_ТоварыНоменклатураАвтоПодборВместо(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	ДанныеВыбора 		 = Неопределено;	
	
	НовыйМассив 		 = рвк_НоменклатураВызовСервера.МассивПолученияДанныхВыбор(); 
	ФиксированныйМассив  = Новый ФиксированныйМассив(НовыйМассив);
	
	Отбор 				 = Новый Структура;
	Отбор.Вставить("ТипНоменклатуры",ФиксированныйМассив);
	
	ПараметрыДляПолученияДанныхВыбора = Новый Структура;
	ПараметрыДляПолученияДанныхВыбора.Вставить("НалогообложениеНДС", рвк_НоменклатураВызовСервера.НалогообложениеНДСПолученияДанныхВыбор());
	ПараметрыДляПолученияДанныхВыбора.Вставить("Отбор",Отбор);
	ПараметрыДляПолученияДанныхВыбора.Вставить("СтрокаПоиска",Текст);
	ПараметрыДляПолученияДанныхВыбора.Вставить("ВыборГруппИЭлементов",ИспользованиеГруппИЭлементов.Элементы);
	ПараметрыДляПолученияДанныхВыбора.Вставить("СпособПоискаСтроки",Неопределено);
	ПараметрыДляПолученияДанныхВыбора.Вставить("ПолнотекстовыйПоиск",Неопределено);
	
	рвк_НоменклатураВызовСервера.НоменклатураОбработкаПолученияДанныхВыбораВДокументПродажи(ДанныеВыбора, ПараметрыДляПолученияДанныхВыбора, СтандартнаяОбработка);
	
	СтандартнаяОбработка = Ложь;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура рвк_ЦенаСНаценкойНаУчетнуюПосле(Команда)

	СтруктураЗаполненияБонусныхБаллов = Неопределено;
	СтруктураПересчетаСуммы = ОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(Объект);
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСумму");
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки", Новый Структура("Очищать", Ложь));
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомАвтоматическойСкидки", Новый Структура("Очищать", Истина));
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомСкидкиБонуснымиБаллами", СтруктураЗаполненияБонусныхБаллов);
	СтруктураДействий.Вставить("ЗаполнитьДубликатыЗависимыхРеквизитов", ЗависимыеРеквизиты());
	СтруктураДействий.Вставить("ОчиститьСуммуВзаиморасчетов");
	СтруктураДействий.Вставить("ПересчитатьСуммуСверхЗаказа", Новый Структура("РеализацияПоступлениеПоЗаказу, ТребуетсяЗалогЗаТару",
		Объект.РеализацияПоЗаказам, Объект.ТребуетсяЗалогЗаТару));

	Для Каждого СтрокаТовары Из Объект.Товары Цикл
		Если ЗначениеЗаполнено(СтрокаТовары.усУчетнаяЦена) 
				И ЗначениеЗаполнено(СтрокаТовары.Количество) Тогда
			СтрокаТовары.Цена = СтрокаТовары.усУчетнаяЦена + СтрокаТовары.усУчетнаяЦена / 100;
			ПроверкаОплатыБонуснымиБаллами(СтрокаТовары, СтруктураЗаполненияБонусныхБаллов);
			ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(СтрокаТовары, СтруктураДействий, КэшированныеЗначения);
		КонецЕсли;
	КонецЦикла;
	
	РассчитатьИтоговыеПоказатели();
	СкидкиНаценкиЗаполнениеКлиент.СброситьФлагСкидкиРассчитаны(ЭтотОбъект);
	
	СобытияФормКлиент.ПриИзмененииЭлемента(ЭтотОбъект, Элементы.Товары);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура рвк_ИнициализироватьЕстьРеквизитСУчетнойЦеной()
	РеквизитыТаблицы = ПолучитьРеквизиты("Объект.Товары");
	Для Каждого Реквизит Из РеквизитыТаблицы Цикл
		Если Реквизит.Имя = "усУчетнаяЦена" Тогда
			рвк_ЕстьРеквизитСУчетнойЦеной = Истина;
			Прервать;		
		КонецЕсли;
	КонецЦикла;
	Элементы.ТоварыЦенаСНаценкойНаУчетную.Доступность = рвк_ЕстьРеквизитСУчетнойЦеной;
КонецПроцедуры

&Перед("НалогообложениеНДСПриИзмененииСервер")
&НаСервере
Процедура рвк_НалогообложениеНДСПриИзмененииСервер()
	Если ЗначениеЗаполнено(Объект.Партнер) И ЗначениеЗаполнено(Объект.Организация) Тогда
		Объект.НалогообложениеНДС = рвк_ОбщийМодульПовтИсп.НалогообложениеНДС(Объект.Организация, Объект.Партнер);
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция рвк_ПолучитьПросрочкуНаСервере(Знач Клиент)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СУММА(РасчетыПоСрокам.ПредоплатаРеглОстаток) КАК НашДолг,
		|	СУММА(РасчетыПоСрокам.ДолгРеглОстаток) КАК Задолженность,
		|	СУММА(ВЫБОР
		|			КОГДА РасчетыПоСрокам.ДатаПлановогоПогашения < НАЧАЛОПЕРИОДА(&ТекущаяДата, ДЕНЬ)
		|				ТОГДА РасчетыПоСрокам.ДолгРеглОстаток
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Просрочено
		|ИЗ
		|	РегистрНакопления.РасчетыСКлиентамиПоСрокам.Остатки(, АналитикаУчетаПоПартнерам.Партнер = &Партнер) КАК РасчетыПоСрокам";
	
	Запрос.УстановитьПараметр("Партнер", Клиент);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	СтруктураРезультата = Новый Структура("Задолженность,Просрочено", 0, 0);
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Задолженность) Тогда
			СтруктураРезультата.Задолженность = ВыборкаДетальныеЗаписи.Задолженность;
		КонецЕсли;
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Просрочено) Тогда
			СтруктураРезультата.Просрочено = ВыборкаДетальныеЗаписи.Просрочено;
		КонецЕсли;
	КонецЕсли;
	
	Возврат СтруктураРезультата;
	
КонецФункции

&НаКлиенте
Процедура рвк_ОбновитьЗадолженностьНаКлиенте()
	
	Если Не ЗначениеЗаполнено(Объект.Партнер) Тогда
		Элементы.ЗадолженностьСтрокой.Заголовок = "";
		Возврат;
	КонецЕсли;
		
	Результат = рвк_ПолучитьПросрочкуНаСервере(Объект.Партнер);
	Если Результат.Задолженность = 0 Тогда
		ЗадолженностьСтрокой = "";		
	ИначеЕсли Результат.Задолженность = Результат.Просрочено Тогда
		ЗадолженностьСтрокой = СтрШаблон("Просрочено: %1", Формат(Результат.Просрочено, "ЧДЦ=0; ЧН="));
	Иначе
		ЗадолженностьСтрокой = СтрШаблон("Задолженность: %1 Просрочено: %2", Формат(Результат.Задолженность, "ЧДЦ=0; ЧН="), Формат(Результат.Просрочено, "ЧДЦ=0; ЧН="));
	КонецЕсли;
	
	Элементы.ЗадолженностьСтрокой.Заголовок = ЗадолженностьСтрокой;
	Если Результат.Просрочено > 0 Тогда
		Элементы.ЗадолженностьСтрокой.ЦветТекста = WebЦвета.КрасноФиолетовый;
	Иначе
		Элементы.ЗадолженностьСтрокой.ЦветТекста = WebЦвета.Черный;
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
&После("ОбновитьТекстСчетаФактурыВыданные")
Процедура рвк_ОбновитьТекстСчетаФактурыВыданные()
	рвк_ОбновитьТекстПриобретение();
КонецПроцедуры

&НаСервере
Процедура рвк_ОбновитьТекстПриобретение() 
	
	ПриобретениеGUID = Документы.РеализацияТоваровУслуг.рвк_ПриобретениеИнтеркампани(Объект.Ссылка);
	Если Не ЗначениеЗаполнено(ПриобретениеGUID) Тогда
		Возврат;
	КонецЕсли;
	
	Приобретение = Документы.ПриобретениеТоваровУслуг.ПолучитьСсылку(Новый УникальныйИдентификатор(ПриобретениеGUID));
	Если Не ЗначениеЗаполнено(Приобретение) Тогда
		Возврат;
	КонецЕсли;
		
	Если Приобретение.ПолучитьОбъект() = Неопределено Тогда
		Возврат;
	КонецЕсли;
	  
	РеквизитыПриобретения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Приобретение, "Номер,Дата");
	ПредставлениеПреобретения = СтрШаблон("Приобретение № %1 от %2", РеквизитыПриобретения.Номер, Формат(РеквизитыПриобретения.Дата, "ДЛФ=D"));
	ЦветТекстаСсылки = ЦветаСтиля.ГиперссылкаЦвет;
	НавигационнаяСсылка = "ОткрытьПриобретениеТоваровИнтеркампани"; //"e1cib/data/Документ.ПриобретениеТоваровУслуг?ref=""" + ПриобретениеGUID + """";
	
	ТекстПриобретение = Новый ФорматированнаяСтрока(ПредставлениеПреобретения,, ЦветТекстаСсылки,, НавигационнаяСсылка);
	
	ТекстыПоляДокументыНаОсновании.Добавить(ТекстПриобретение);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция рвк_ПолучитьСсылкуПриобретения(Знач РеализацияСсылка)
	ПриобретениеGUID = Документы.РеализацияТоваровУслуг.рвк_ПриобретениеИнтеркампани(РеализацияСсылка);
	Возврат Документы.ПриобретениеТоваровУслуг.ПолучитьСсылку(Новый УникальныйИдентификатор(ПриобретениеGUID));
КонецФункции

#КонецОбласти
